{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-51-23408a5d5124>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "dtype": "float32", "function_type": "lambda", "trainable": true, "name": "lambda_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "activation": "relu", "name": "conv2d_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "activation": "relu", "name": "conv2d_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "activation": "relu", "name": "conv2d_7", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_7", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "activation": "relu", "name": "conv2d_8", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_8", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "name": "dense_16", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "name": "dense_17", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "name": "dense_18", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}]}